<!-- dflook/terraform-github-actions {"workspace":"fix-no-state-2","backend_type":"remote","backend":"75958638d69e8fa36b580ae535f2e9fb5dc26a69528f9a529b1ac5266cb470d1","plan_job_ref":"Job Test Terraform cloud #174 at https://github.com/dflook/terraform-github-actions/actions/runs/5662408202","plan_hash":"72941edf19984dc43e0c8988c6eb49a790c6a6b9270b2f013a6395dfdb37b95c","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __fix-no-state-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #174](https://github.com/dflook/terraform-github-actions/actions/runs/5662408202)